Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra Discussions of Thus-Gone Ones

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Blessed One was residing in Śrāvastī in the Jeta Grove, the park of Anāthapiṇḍada, together with a great monastic assembly of one thousand two hundred fifty monks.

source: །དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བསོད་སྙོམས་གཅིག་གིས་ཟླ་བ་གསུམ་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་ནས་བཞུགས་སོ།
en: At that time, the Thus-Gone One remained in meditative seclusion for three months, sustained by a single alms meal.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཟླ་བ་གསུམ་པོ་དེ་ཉིད་འདས་པ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: When those three months had elapsed, youthful Mañjuśrī went to the Blessed One, bowed down at his feet, and sat to one side.

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཡང་ཟླ་བ་གསུམ་པོ་འདས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Venerable Śāriputra also went to the Blessed One when those three months had elapsed, bowed down at his feet, and sat to one side.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱའི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་གསུས་པོ་ཆེ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀ་པི་ན་དང་། ཚེ་དང་ལྡན་པ་དོན་ཡོད་རྒྱལ་པོ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་དང་། ཚེ་དང་ལྡན་པ་ནམ་གྲུ་དང་། ཚེ་དང་ལྡན་པ་འཆར་ཀ་ནག་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་གྲགས་འབྱིན་དང་། ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་དང་། ཚེ་དང་ལྡན་པ་གྲོ་ཞིན་སྐྱེས་བྱེ་བ་ཉི་ཤུ་པ་དང་། ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་དང་། གནས་བརྟན་དེ་ལྟ་བུ་དག་དང་། དེ་དག་ལ་སོགས་པ་ཉན་ཐོས་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་བར་དག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: In the same way, everyone else among the one thousand two hundred fifty hearers—including the elders venerable Mahāmaudgalyāyana, venerable Mahākāśyapa, venerable Mahākātyāyana, venerable Mahākauṣṭhila, venerable Kapphiṇa, venerable Amogharāja, venerable Subhūti, venerable Pūrṇamaitrāyaṇīputra, venerable Upāli, venerable Revata, venerable Kālodāyin, venerable Ānanda, venerable Yaśodeva, venerable Rāṣṭrapāla, venerable Śroṇakoṭīviṃśa, and venerable Rāhula—all went to the Blessed One, bowed down at his feet, and sat to one side.

source: རིགས་ཀྱི་བུ་བཟང་སྐྱོང་དང་། རིགས་ཀྱི་བུ་རིན་ཆེན་འབྱུང་གནས་དང་། ཡོན་ཏན་སྦེད་དང་། རལ་གྲིའི་ཚོགས་ཅན་དང་། མིས་བྱིན་དང་། ཆུ་ལྷ་དང་། དབང་པོས་བྱིན་དང་། གུས་བྱིན་དང་། མིས་བྱིན་དང་། དེ་དག་དང་གཞན་ཡང་དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་ཐམ་པ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Moreover, a total of five thousand bodhisattvas—including the noble sons Bhadrapāla, Ratnasambhava, Guṇagupta, Holder of the Swords, Naradatta, Varuṇa, Indradatta, Giving Faith, and Naradatta—all went to the Blessed One, bowed down at his feet, and sat to one side.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་ལྷན་ཅིག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Śakra, king of the gods, together with the gods of the Heaven of the Thirty-Three, also went to the Blessed One, bowed down at his feet, and sat to one side.

source: ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་དང་། ལྷའི་བུ་དཔལ་བཟང་དང་། ལྷའི་བུ་སྤྲུལ་པ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས།
en: The gods Santuṣita, Śrībhadra, and Nirmāṇa also went to the Blessed One, bowed down at his feet, and sat to one side.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ཡང་ལྷའི་བུ་སྟོང་ཕྲག་དུ་མ་དག་དང་ལྷན་ཅིག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Brahmā, the lord of the Sahā universe, together with many thousands of gods, also went to the Blessed One, bowed down at his feet, and sat to one side.

source: །དེ་ནས་ལྷའི་བུ་དབང་ཕྱུག་དང་། ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་། ལྷའི་བུ་རབ་ཞི་དུལ་བའི་དབང་ཕྱུག་རྣམས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་སྟོང་ཕྲག་དུ་མ་དག་དང་ལྷན་ཅིག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: The gods Īśvara, Maheśvara, and Praśāntavinīteśvara, along with many thousands of divine beings from the pure realms, also went to the Blessed One, bowed down at his feet, and sat to one side.

source: །དེ་ནས་ལྷའི་བུ་ཉི་མ་དང་། ལྷའི་བུ་ཟླ་བ་ཡང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Moreover, the gods Sūrya and Candra also went to the Blessed One, bowed down at his feet, and sat to one side.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: At that point youthful Mañjuśrī rose from his seat, draped his upper robe over one shoulder, and knelt with his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གནས་པ་གང་གིས་དགུང་ཟླ་གསུམ་བཞུགས་ཤིང་།
en: With his palms joined, he bowed toward the Blessed One and asked, “Blessed One, how did you spend the last three months?

source: བཅོམ་ལྡན་འདས་ཀྱི་དབང་པོ་རྣམས་ནི་ཡོངས་སུ་དང་། ཞལ་མདོག་ནི་ཡོངས་སུ་དག །སྐུ་མདོག་ནི་ཡོངས་སུ་དཀར་ལགས།
en: The faculties of the Blessed One are so clear, your face is so pure, and your complexion is so bright!”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་ང་ནི་སངས་རྒྱས་བགྲོ་བས་ཟླ་བ་གསུམ་གནས་ཤིང་།
en: The Blessed One replied, “Mañjuśrī, I have spent three months having discussions about buddhas.

source: འཇམ་དཔལ་ང་ནི་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བས་ཟླ་བ་གསུམ་གནས་གནས་སོ།
en: Mañjuśrī, I have spent three months having discussions about thus-gone ones and having discussions about the Dharma.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་སངས་རྒྱས་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་དེ་གང་ལགས།
en: Mañjuśrī asked, “Blessed One, how were your discussions about buddhas, discussions about thus-gone ones, and discussions about the Dharma?

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་ཀྱི་བགྲོ་བ་དེའི་ངོ་བོ་ཇི་ལྟ་བུ་ལགས།
en: Blessed One, what was the essence of those discussions about buddhas, thus-gone ones, and the Dharma?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་ཐབས་ཅིག་ཏུ་མོལ་པ་མཛད་པ་ཇི་ལྟ་བུ་ལགས་པའི་བཀའ་མཆིད་དེའི་སྣོད་དུ་བདག་ཀྱང་གྱུར་ན་ལེགས་ལགས་སོ།
en: Blessed One, it would be excellent if you would share the discussions between yourself and the thus-gone ones with us, if we are suitable recipients.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One gave his approval to youthful Mañjuśrī, saying, “Mañjuśrī, excellent, excellent!

source: །འཇམ་དཔལ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པ་དེ་དག་དང་ཐབས་ཅིག་ཏུ་བགྲོ་བའི་ངོ་བོ་གང་ཡིན་པའི་དོན་འདི་ཉིད་འདྲི་བར་སེམས་པ་ནི་འཇམ་དཔལ་ཁྱོད་ཡང་ལེགས་སོ།
en: Mañjuśrī, it is excellent that you thought to ask the Thus-Gone One about the essence of my discussions with the thus-gone ones.

source: །འཇམ་དཔལ་ཁྱོད་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་ཤིང་སངས་རྒྱས་འབུམ་ཕྲག་མང་པོ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ།
en: Mañjuśrī, you have served the victorious ones of the past and generated roots of virtue with many hundreds of thousands of buddhas.

source: སངས་རྒྱས་འབུམ་ཕྲག་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་སུ་ཟིན་ཀྱང་། འཇམ་དཔལ་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་མཐུས་ན་ཆོས་བགྲོ་བ་ལ་ཁྱོད་སྤོབས་སོ།
en: Even though you already served many hundreds of thousands of buddhas, Mañjuśrī, it is because of the strength of these noble sons and daughters that you now speak about those Dharma discussions. “

source: །འཇམ་དཔལ་སངས་རྒྱས་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་ཀྱི་བགྲོ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དག་གི་ལག་ཏུ་འགྲོ་བ་དེ་དག་ནི་བདུད་སྡིག་ཅན་གྱི་ལག་ཏུ་འགྲོ་བར་མི་འགྱུར་རོ།
en: Mañjuśrī, those individuals who encounter this teaching on the discussions about buddhas, discussions about thus-gone ones, and discussions about the Dharma will not encounter the wicked Māra.

source: །འཇམ་དཔལ་སངས་རྒྱས་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དག་གི་ལག་ཏུ་འགྲོ་བའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་མདུན་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་མངོན་སུམ་དུ་གྱུར་ལ།
en: Mañjuśrī, those noble sons and daughters who encounter this teaching on the discussions about buddhas, thus-gone ones, and the Dharma will behold the Thus-Gone One before them.

source: དེ་དག་ཀྱང་ངས་མཐོང་བར་རིག་པར་བྱའོ།
en: You should know that I will also see them.

source: །འཇམ་དཔལ་སངས་རྒྱས་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་འདི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་དག་གི་ལག་ཏུ་འགྲོ་བ་དང་། གང་དག་སྤོང་བར་བྱེད་པ་དེ་དག་ཀྱང་ངས་མཐོང་ངོ་།
en: Mañjuśrī, I will see those noble sons and daughters who encounter this teaching on the discussions about buddhas, discussions about thus-gone ones, and discussions about the Dharma, and I will see those who reject it as well. “

source: །འཇམ་དཔལ་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤོང་བར་མི་བྱེད་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དད་པ་དང་ལྡན་པར་འགྱུར། དང་བར་འགྱུར། དྲང་བ་དང་། གཡོ་མེད་པ་དང་། སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་དང་། ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ། །
en: Mañjuśrī, those noble sons and daughters who do not reject this teaching will be faithful, trusting, sincere, and honest, and they will have perfect behavior and motivation.

source: འཇམ་དཔལ་ཡང་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་ཚུལ་ཁྲིམས་དང་ལྡན་པར་འགྱུར་རོ།
en: Furthermore, Mañjuśrī, those noble sons and daughters will develop discipline.

source: །ལེ་ལོ་ཅན་དང་། བརྣབ་སེམས་ཅན་དང་། གནོད་སེམས་ཅན་གྱི་སེམས་སུ་མི་འགྱུར་རོ།
en: They will not be lazy, covetous, or malicious.

source: །དྲན་པ་ཉམས་པ་དང་། སེར་སྣ་ཅན་དུ་མི་འགྱུར་རོ།
en: They will not be careless or stingy.

source: །འཇམ་དཔལ་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་ཚུལ་ཁྲིམས་དང་ལྡན་པར་འགྱུར་རོ།
en: Mañjuśrī, such noble sons and daughters will develop discipline.

source: །དེ་དག་ནི་ལེ་ལོ་མེད་པ་དང་། བརྣབ་སེམས་མེད་པ་དང་། གནོད་སེམས་ཀྱི་སེམས་མེད་པ་དང་། སེར་སྣ་མེད་པ་དང་།
en: They will be free of laziness, covetousness, malice, and stinginess.

source: དྲན་པ་དང་ལྡན་པ་དང་། བློ་གྲོས་དང་ལྡན་པ་དང་། རྟོགས་པ་དང་ལྡན་པ་དང་།
en: They will develop mindfulness, intelligence, and understanding.

source: ཁྲེལ་ཡོད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་དང་། མོས་པ་མང་བར་འགྱུར་རོ། །
en: They will have perfect modesty, they will act diligently, and their trust will be great.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པ་དང་། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་མདུན་དུ་སངས་རྒྱས་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་ཏིང་ངེ་འཛིན་འདི་བཀའ་སྩལ་ཅིང་བཤད་པ་དེའི་དུས་ལ་བབ་ལགས་སོ།
en: To that Mañjuśrī replied, “Blessed One, in that case, now is the time for the Blessed One to teach and explain the absorption of the teaching on the discussions about buddhas, discussions about thus-gone ones, and discussions about the Dharma, right here before the gods, humans, and asuras—here before the whole world including its gods.

source: །བདེ་བར་གཤེགས་པ་དེའི་དུས་ལ་བབ་ལགས་ཏེ།
en: Well-Gone One, the time has come for it.

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་ལས་ཐོས་ནས་དེ་བཞིན་ཉིད་དུ་འཛིན་པར་འགྱུར་ལགས་སོ། །
en: When we have heard it from the Blessed One, we will remember what you say.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་ཁྱོད་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: The Blessed One replied, “Mañjuśrī, for that reason, listen carefully and pay attention. I shall now explain.”

source: །བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Youthful Mañjuśrī replied, “Very well, Blessed One,” and he listened as the Blessed One had instructed.

source: །འཇམ་དཔལ་ཤར་ཕྱོགས་ལོགས་ན། སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: The Blessed One continued, “Mañjuśrī, to the east, beyond one thousand buddha fields, is the world known as Abhirati.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: There, the thus-gone, worthy, perfect Buddha Akṣobhya resides, flourishes, prospers, and teaches Dharma.

source: །འཇམ་དཔལ་དེ་ནས་ངས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པས་གང་ལ་གནས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, there I asked the thus-gone, worthy, perfect Buddha Akṣobhya, ‘On what basis did the thus-gone, worthy, perfect Buddha Akṣobhya fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་བདག་ཏུ་འདུ་ཤེས་པ་གང་ལ་གནས་པ་དེ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: Mañjuśrī, the thus-gone Akṣobhya replied to me, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of childish, ordinary beings’ perception of a self.’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་བདག་ཏུ་འདུ་ཤེས་པ་གང་ལ་གནས།
en: Mañjuśrī, I then asked the thus-gone Akṣobhya, ‘What is the basis for childish, ordinary beings’ perception of a self?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །མི་ཤེས་པ་ལ་གནས་ནས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་བདག་ཏུ་འདུ་ཤེས་པ་བྱུང་བ་ནི་མི་གནས་པ་སྟེ།
en: He replied to me, ‘Since it is based on ignorance, childish, ordinary beings’ perception of a self is baseless.

source: དེ་ལྟ་བུ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: It is on such a basis that I fully awakened to unexcelled and perfect buddhahood.’

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་ཅི་ལ་གནས་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, the thus-gone Akṣobhya then asked me, ‘On what basis did the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་གང་ལ་གནས་པའི་ལྟ་བར་གྱུར་པ་དྲུག་ཅུ་རྩ་གཉིས་ཀུན་ཏུ་འབྱུང་བ་དེ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Mañjuśrī, I then replied to the thus-gone Akṣobhya, ‘I fully awakened to unexcelled and perfect buddhahood based on the manifestation of the sixty-two convictions that childish, ordinary beings maintain.’

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ལྟ་བར་གྱུར་པ་དྲུག་ཅུ་རྩ་གཉིས་གང་ལ་གནས་ཏེ་ཀུན་ཏུ་འབྱུང་བར་འགྱུར།
en: Mañjuśrī, the thus-gone Akṣobhya asked me, ‘On what basis do the sixty-two convictions of childish, ordinary beings manifest?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྒྱུ་མའི་སྐྱེས་བུ་གང་ལ་གནས་པའི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་རབ་ཏུ་འཇུག་པ་དེ་ལ་གནས་ནས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ལྟ་བར་གྱུར་པ་དྲུག་ཅུ་རྩ་གཉིས་ཀུན་ཏུ་འབྱུང་བ་དེ་ལྟ་བུ་ལ་གནས་ཏེ།
en: Mañjuśrī, I replied to the thus-gone Akṣobhya, ‘The sixty-two convictions of childish, ordinary beings manifest based on fully engaging in the phenomena of the mind and mental factors that are the basis of illusory beings.

source: ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེ་ནི་ཡིད་ཀྱིས་ཡང་དག་པར་བགྲོ་བའི་དྲི་བའོ།
en: I fully awakened to unexcelled and perfect buddhahood on that same basis.’ Such were the questions in the discussion we had by means of the mind. “

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་སྲུང་ཞེས་བྱ་བ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Furthermore, Mañjuśrī, in the eastern direction, the thus-gone, worthy, perfect Buddha Well Protected asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་གང་ལ་གནས་པའི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཀུན་ཏུ་འབྱུང་བ་དེ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Mañjuśrī, I said to the Thus-Gone One, ‘I fully awakened to unexcelled and perfect buddhahood based on the manifestation of desire, aversion, and delusion, which form the basis for childish, ordinary, ordinary beings.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གང་ལ་གནས་ཏེ་ཀུན་ཏུ་འབྱུང་བར་འགྱུར།
en: Mañjuśrī, the Thus-Gone One then asked me, ‘On what basis do the desire, aversion, and delusion of childish, ordinary beings manifest?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་ངས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ལ་གནས་ནས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཀུན་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: Mañjuśrī, I replied to the Thus-Gone One, ‘The desire, aversion, and delusion of childish, ordinary beings manifest on the basis of the realm of the inconceivable.’ ”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དེ་བསམ་གྱིས་མི་ཁྱབ་པ་ལགས།
en: Youthful Mañjuśrī said to the Blessed One, “Blessed One, why is it that the realm of the inconceivable is inconceivable”?

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་གནས་མེད་པ་ཞེས་བྱ་བའི་གནས་མེད་པ་ལ་གནས་ཏེ། བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཀུན་ཏུ་འབྱུང་ངོ་།
en: The Blessed One said, “Mañjuśrī, it is based on the absence of a basis known as baseless that the desire, aversion, and delusion of childish, ordinary beings manifest. “

source: །འཇམ་དཔལ་གཞན་ཡང་ངས་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྲུང་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་སྲུང་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, I asked the thus-gone Well Protected, ‘On what basis did the thus-gone, worthy, perfect Buddha Well Protected fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་མཚམས་མེད་པའི་ལས་རྣམས་གང་ལ་གནས་ཏེ་ཀུན་ཏུ་འབྱུང་བ་དེ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: The Thus-Gone One told me, ‘I fully awakened to unexcelled and perfect buddhahood based on the manifestation of the acts of immediate consequence of childish, ordinary beings.’ ”

source: ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་མཚམས་མ་མཆིས་པའི་ལས་རྣམས་གང་ལ་གནས་ཏེ་ཀུན་ཏུ་འབྱུང་ལགས།
en: Youthful Mañjuśrī asked the Blessed One, “On what basis do the acts of immediate consequence of childish, ordinary beings manifest?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་མཚམས་མེད་པའི་ལས་རྣམས་ནི་ཡོད་པ་མ་ཡིན་པ་དེ་ལ་གནས་ཏེ་ཀུན་ཏུ་འབྱུང་ངོ་།
en: The Thus-Gone One said, “Mañjuśrī, the acts of immediate consequence of childish, ordinary beings manifest on the basis of nonexistence.

source: །འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་མི་ཞིག་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་ན་སྦྲུལ་གདུག་པ་ཞིག་ལག་གིས་བཟུང་བ་ལས། དེས་དེ་ཟིན་ནས་གཞི་དེ་ལས་དེ་འཆི་བར་འགྱུར་བའམ།
en: Mañjuśrī, it is like this: when sleeping, a person may dream that they grab a poisonous snake, get bitten, and die there.

source: འཆི་བ་ལ་ཐུག་པ་ཙམ་དུ་སྡུག་བསྔལ་ཞིང་དེ་འཆི་བར་ཉེ་བའི་ཚོར་བས་རེག་པ་ལས་སད་པར་གྱུར་ན།
en: Due to the pain of their brush with death and the agony of dying, the person may then awaken.

source: སད་མ་ཐག་ཏུ་དེའི་སྡུག་བསྔལ་གྱི་ཚོར་བ་ཉམས་སུ་མྱོང་བ་དེ་དང་དེ་དག་མེད་པ་ཉིད་དུ་ཤེས་པ་ན་འཇམ་དཔལ་དེ་ཇི་སྙམ་དུ་སེམས།
en: However, as soon as they awaken, they will understand that painful experience to be nonexistent.

source: ཅི་མི་དེ་སྦྲུལ་གདུག་པ་དེས་ཟིན་ཏམ།
en: In that case, tell me, Mañjuśrī—was that person bitten by a poisonous snake?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: No, Blessed One, they were not.” “

source: །འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། མི་དེ་མ་ཟིན་བཞིན་དུ་སྡུག་བསྔལ་བར་གྱུར་ཏམ།
en: Tell me, Mañjuśrī—since they were not bitten, did they suffer?” “

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: བཅོམ་ལྡན་འདས་དེ་ན་སྦྲུལ་གདུག་པ་ཡང་མ་མཆིས་ལ། བཅོམ་ལྡན་འདས་གང་ཟིན་པ་དེ་ཡང་མ་མཆིས་པ་ལགས་ན།
en: Blessed One, just as that poisonous snake did not exist, the one who was bitten also did not exist.

source: དེ་ན་ཚོར་བར་འགྱུར་ཞིང་མངོན་པ་ལྟ་ག་ལ་ཞིག་མཆིས།
en: Therefore, how could their agony and experience exist?” “

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ནི་མི་གནས་པ་སྟེ།
en: In the same way, Mañjuśrī, all phenomena are devoid of a basis.

source: ཆོས་ཐམས་ཅད་མི་གནས་པ་ཅི་འདྲ་བར་ཟིན་པ་ཡང་དེ་དང་འདྲ་སྟེ། ཚོར་བ་ཡང་དེ་དང་འདྲའོ།
en: Just as all phenomena are devoid of a basis, so are the bite and the agony.

source: །ཚོར་བ་ཅི་འདྲ་བར་སྦྲུལ་གདུག་པ་ཡང་དེ་དང་འདྲའོ།
en: Just as that agony is, so too is the poisonous snake.

source: །སྦྲུལ་གདུག་པ་ཅི་འདྲ་བར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲའོ།
en: Just as the poisonous snake is, so too are all phenomena.

source: །ཆོས་ཐམས་ཅད་ཅི་འདྲ་བར་མཚམས་མེད་པ་ཡང་དེ་དང་འདྲའོ།
en: Just as all phenomena are, so too are the acts of immediate consequence.

source: །མཚམས་མེད་པ་ཅི་འདྲ་བར་བྱང་ཆུབ་ཀྱང་དེ་དང་འདྲའོ།
en: Just as the acts of immediate consequence are, so too is awakening.

source: །བྱང་ཆུབ་ཅི་འདྲ་བར་གནས་ཀྱང་དེ་དང་འདྲ་སྟེ།
en: Just as awakening is, so too is any basis.

source: དེ་ལྟ་བུ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: It is on such a basis that I fully awakened to unexcelled and perfect buddhahood.

source: དེ་ནི་ཡིད་ཀྱི་ཡང་དག་པར་བགྲོ་བའི་དྲི་བའོ།
en: Such were the questions in the discussion we had by means of the mind. “

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་རབ་ལྟ་བུ་ཞེས་བྱ་བ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་རབ་ལྟ་བུས་ཅི་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Furthermore, Mañjuśrī, in the east, I asked the thus-gone, worthy, perfect Buddha Sumerukalpa, ‘On what basis did the thus-gone, worthy, perfect Buddha Sumerukalpa fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་རི་རབ་ལྟ་བུས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་གང་ལ་གནས་པའི་མཐའ་དེ་ལ་གནས་ནས་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: Mañjuśrī, the thus-gone Sumerukalpa replied, ‘I fully awakened to unexcelled and perfect buddhahood based on the limits of the earth element, the water element, the fire element, the wind element, and the space element.’
